Revit 2026 API

# EditorInteraction Properties

---

The EditorInteraction type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | InteractionType | The type of interaction. |

#### Reference

EditorInteraction Class

Autodesk.Revit.UI Namespace